# Clean and Manipulate Data

In [1]:
import pandas as pd

# Load the Dataset
We will start by importing the necessary libraries and loading the dataset into a pandas DataFrame. We will use the read_csv function to read the data from a CSV file into a DataFrame.

In [2]:
# Load the dataset into a DataFrame
df = pd.read_csv("https://raw.githubusercontent.com/cbtn-data-science-ml/python-for-data-analysis/main/datasets/mls_salaries.csv")

In [4]:
df.tail()

    club last_name first_name position  base_salary  guaranteed_compensation
610  VAN   Teibert    Russell        M     126500.0                 194000.0
611  VAN  Tornaghi      Paolo       GK      80000.0                  80000.0
612  VAN    Waston    Kendall        D     350000.0                 368125.0
613  NaN       NaN        NaN      NaN          NaN                      NaN
614  VAN  Williams    Sheanon        D     175000.0                 184000.0

# Clean Data
Clean the data to prepare it for further analysis by checking for missing values.

In [5]:
# Check for missing values
df.isnull().sum()

club                        1
last_name                   1
first_name                  5
position                   11
base_salary                 1
guaranteed_compensation     1
dtype: int64

# Manipualte Data
Clean the data to prepare it for further analysis by checking for missing values.

* Convert data types for columns as needed
* Remove unnecessary columns
* Add new columns or transform existing columns

In [6]:
# Drop missing values
df.dropna(inplace=True)

In [7]:
# Check for missing values
df.isnull().sum()

club                       0
last_name                  0
first_name                 0
position                   0
base_salary                0
guaranteed_compensation    0
dtype: int64

In [8]:
def clean_currency(x):
    """ If the value is a string, then remove currency symbol and delimiters
    otherwise, the value is numeric and can be converted
    """
    if isinstance(x, str):
        return(x.replace('$', '').replace(',', ''))
    return(x)

# Convert data types for columns
df['base_salary'] = df['base_salary'].apply(clean_currency).astype('int')

In [9]:
df['base_salary']

0      1912500
1        65625
2       150000
3        99225
4        65000
        ...
609     352000
610     126500
611      80000
612     350000
614     175000
Name: base_salary, Length: 600, dtype: int32

In [12]:
df

    club last_name first_name position  base_salary  guaranteed_compensation
0    ATL   Almiron     Miguel        M      1912500                  2297000
1    ATL   Ambrose      Mikey        D        65625                    65625
2    ATL      Asad      Yamil        M       150000                   150000
3    ATL     Bloom       Mark        D        99225                   106573
4    ATL  Carleton     Andrew        F        65000                    77400
..   ...       ...        ...      ...          ...                      ...
609  VAN   Techera   Cristian        M       352000                   377000
610  VAN   Teibert    Russell        M       126500                   194000
611  VAN  Tornaghi      Paolo       GK        80000                    80000
612  VAN    Waston    Kendall        D       350000                   368125
614  VAN  Williams    Sheanon        D       175000                   184000

[600 rows x 6 columns]

In [10]:
df['guaranteed_compensation'] = df['guaranteed_compensation'].apply(clean_currency).astype('int')

In [11]:
df['guaranteed_compensation']

0      2297000
1        65625
2       150000
3       106573
4        77400
        ...
609     377000
610     194000
611      80000
612     368125
614     184000
Name: guaranteed_compensation, Length: 600, dtype: int32

In [13]:
df

    club last_name first_name position  base_salary  guaranteed_compensation
0    ATL   Almiron     Miguel        M      1912500                  2297000
1    ATL   Ambrose      Mikey        D        65625                    65625
2    ATL      Asad      Yamil        M       150000                   150000
3    ATL     Bloom       Mark        D        99225                   106573
4    ATL  Carleton     Andrew        F        65000                    77400
..   ...       ...        ...      ...          ...                      ...
609  VAN   Techera   Cristian        M       352000                   377000
610  VAN   Teibert    Russell        M       126500                   194000
611  VAN  Tornaghi      Paolo       GK        80000                    80000
612  VAN    Waston    Kendall        D       350000                   368125
614  VAN  Williams    Sheanon        D       175000                   184000

[600 rows x 6 columns]